Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

Check the number of rentals for each customer for May

Check the number of rentals for each customer for June

Hint: You can store the results from the two queries in two separate dataframes.

Write a function that checks if customer borrowed more or less books in the month of June as compared to May.

In [1]:
!pip install sqlalchemy
!pip install PyMySQL

Requirement already satisfied: sqlalchemy in c:\users\urgpa\anaconda3\lib\site-packages (1.3.20)
Requirement already satisfied: PyMySQL in c:\users\urgpa\anaconda3\lib\site-packages (1.0.2)

In [2]:
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [3]:
from sqlalchemy import create_engine
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)

In [11]:
data = pd.read_sql_query('select*from sakila.rentals_june', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [26]:
query1 = pd.read_sql_query('select customer_id, count(rental_id) as MAY from sakila.rentals_may \
group by customer_id \
order by customer_id asc', engine)
query1.head()

   customer_id  MAY
0            1    2
1            2    1
2            3    2
3            5    3
4            6    3

In [27]:
query2 = pd.read_sql_query('select customer_id, count(rental_id) as JUNE from sakila.rentals_june \
group by customer_id \
order by customer_id asc', engine)
query2.head()

   customer_id  JUNE
0            1     7
1            2     1
2            3     4
3            4     6
4            5     5

In [29]:
data1 = query1.merge(query2, left_on='customer_id', right_on='customer_id')
data1.head()

   customer_id  MAY  JUNE
0            1    2     7
1            2    1     1
2            3    2     4
3            5    3     5
4            6    3     4

In [32]:
data1.columns = ['client','may','june']

In [33]:
data1.head()

   client  may  june
0       1    2     7
1       2    1     1
2       3    2     4
3       5    3     5
4       6    3     4

NameError: name 'df1' is not defined

Write a function that checks if customer borrowed more or less books in the month of June as compared to May.

In [67]:
def campare_may_june (df1, df2, join_name,cols, how):#df,df,str,list,str
    data_x = df1.merge(df2,how = how, left_on= join_name, right_on=join_name)
    data_x.columns = cols
    data_x["more on may"]= data_x[cols[1]] > data_x[cols[2]]
    return data_x

In [68]:
daton = campare_may_june(query1, query2,"customer_id",['customer_id','may','june'],"inner" )

In [69]:
daton.head()

   customer_id  may  june  more on may
0            1    2     7        False
1            2    1     1        False
2            3    2     4        False
3            5    3     5        False
4            6    3     4        False